name: "brca"
layers {
  name: "patch"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "./vic_train.txt"
    shuffle: true
    batch_size: 30
  }
  transform_param {
    crop_size: 400
    mirror: true
  }
  include: { phase: TRAIN }
}
layers {
  name: "patch"
  type: IMAGE_DATA
  top: "data"
  top: "label"
  image_data_param {
    source: "./vic_test.txt"
    shuffle: true
    batch_size: 30
  }
  transform_param {
    crop_size: 400
    mirror: false
  }
  include: { phase: TEST }
}



layers {
  name: "conv1"
  type: CONVOLUTION
  bottom: "data"
  top: "conv1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 80
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu1"
  type: RELU
  bottom: "conv1"
  top: "conv1"
}
layers {
  name: "norm1"
  type: LRN
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "pool1"
  type: POOLING
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}



layers {
  name: "conv2"
  type: CONVOLUTION
  bottom: "pool1"
  top: "conv2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 120
    kernel_size: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu2"
  type: RELU
  bottom: "conv2"
  top: "conv2"
}
layers {
  name: "norm2"
  type: LRN
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layers {
  name: "pool2"
  type: POOLING
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}



layers {
  name: "conv3"
  type: CONVOLUTION
  bottom: "pool2"
  top: "conv3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 160
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layers {
  name: "relu3"
  type: RELU
  bottom: "conv3"
  top: "conv3"
}



layers {
  name: "conv4"
  type: CONVOLUTION
  bottom: "conv3"
  top: "conv4"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  convolution_param {
    num_output: 200
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu4"
  type: RELU
  bottom: "conv4"
  top: "conv4"
}
layers {
  name: "pool4"
  type: POOLING
  bottom: "conv4"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}



layers {
    name:"conv5"
    type:CONVOLUTION
    bottom:"pool4"
    top:"conv5"
    blobs_lr:1
    blobs_lr:2
    weight_decay:1
    weight_decay:0
    convolution_param{
        num_output:160
        kernel_size:3
        weight_filler:{
            type:"gaussian"
            std:0.01
            }
        bias_filler{
            type:"constant"
            value:0
            }
        }
    }
layers {
    name:"relu5"
    type:RELU
    bottom:"conv5"
    top:"conv5"
    }


layers{
    name:"conv6"
    type:CONVOLUTION
    bottom:"conv5"
    top:"conv6"
    blobs_lr:1
    blobs_lr:2
    weight_decay:1
    weight_decay:0
    convolution_param{
        num_output:200
        kernel_size:3
        weight_filler{
            type:"gaussian"
            std:0.01
            }
        bias_filler{
            type:"constant"
            value:0.1
            }
        }
    }
layers{
    name:"relu6"
    type:RELU
    bottom:"conv6"
    top:"conv6"
    }
layers{
    name:"pool6"
    type:POOLING
    bottom:"conv6"
    top:"pool6"
    pooling_param{
        pool:MAX
        kernel_size:3
        stride:2
        }
    }


layers{
    name:"conv7"
    type:CONVOLUTION
    bottom:"pool6"
    top:"conv7"
    blobs_lr:1
    blobs_lr:2
    weight_decay:1
    weight_decay:0
    convolution_param{
        num_output:120
        kernel_size:3
        weight_filler{
            type:"gaussian"
            std:0.01
        }
        bias_filler{
            type:"constant"
            value:0.1
        }
    }
}
layers{
    name:"relu7"
    type:RELU
    bottom:"conv7"
    top:"conv7"
}
layers{
    name:"norm7"
    type:LRN
    bottom:"conv7"
    top:"norm7"
    lrn_param{
        local_size:5
        alpha:0.0001
        beta:0.75
    }
}

layers{
    name:"pool7"
    type:POOLING
    bottom:"norm7"
    top:"pool7"
    pooling_param{
        pool:MAX
        kernel_size:3
        stride:2
    }
}


layers {
  name: "ip1"
  type: INNER_PRODUCT
  bottom: "pool7"
  top: "ip1"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 320
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu_ip1"
  type: RELU
  bottom: "ip1"
  top: "ip1"
}
layers {
  name: "drop1"
  type: DROPOUT
  bottom: "ip1"
  top: "ip1"
  dropout_param {
    dropout_ratio: 0.5
  }
}



layers {
  name: "ip2"
  type: INNER_PRODUCT
  bottom: "ip1"
  top: "ip2"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 320
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layers {
  name: "relu_ip2"
  type: RELU
  bottom: "ip2"
  top: "ip2"
}
layers {
  name: "drop2"
  type: DROPOUT
  bottom: "ip2"
  top: "ip2"
  dropout_param {
    dropout_ratio: 0.5
  }
}



layers {
  name: "ip3"
  type: INNER_PRODUCT
  bottom: "ip2"
  top: "ip3"
  blobs_lr: 1
  blobs_lr: 2
  weight_decay: 1
  weight_decay: 0
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}



layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "ip3"
  bottom: "label"
  top: "accuracy"
  include: { phase: TEST }
}
layers {
  name: "loss"
  type: SOFTMAX_LOSS
  bottom: "ip3"
  bottom: "label"
  top: "loss"
}

